# Regular Expression

In [1]:
# https://regex101.com/ incele ve \d\d bu iki yan yana digiti ayırır.

In [3]:
import re
import pandas as pd

In [4]:
text = 'A23B'

In [10]:
num = re.search('\d\d', text)
print(num)

<re.Match object; span=(1, 3), match='23'>

In [12]:
print(num.group())

23

In [13]:
text = '4PM'

In [15]:
nondeci = re.search('\D\D', text)
nondeci.group()

'PM'

In [18]:
text = 'My phone number is 5055552356'

num1=re.search(10*"\d", text)
num1.group()

'5055552356'

In [20]:
text = 'My phone number is 5055552356'

num1=re.search("(\d\d\d)(\d\d\d)(\d\d\d\d)", text)
num1.group(2)

'555'

In [24]:
value = '0 1, t 10, o 100. 100000'

In [26]:
output = re.findall("\d{1,6}", value)
output

['0', '1', '10', '100', '100000']

In [30]:
phone = "2004-959-559 # This is Phone Number"

output = re.sub('\D', '', phone)

output

'2004959559'

In [29]:
phone = "2004-959-559 # This is Phone Number"

output = re.sub('\D', '*', phone)

output

'2004*959*559***********************'

In [31]:
s = pd.Series(['a3', 'b4', 'c5'])

In [32]:
s

0    a3
1    b4
2    c5
dtype: object

In [35]:
s.str.extract('(\d)')

   0
0  3
1  4
2  5

In [33]:
s.str.extract('(\d\d)')

     0
0  NaN
1  NaN
2  NaN

In [34]:
s.str.extract('(\D)')

   0
0  a
1  b
2  c

### Expressions :
***
`\d`                         Any numeric digit from `0` to `9`.
`\D`                         Matches any character which is not a decimal digit.
                           This is the opposite of `\d`.
`\w`                         Any letter, numeric digit, or the underscore
                           character.  (Think of this as matching
                           "word" characters.)
`\W`                         Any character that is not a letter,
                           numeric digit, or the underscore character.
`\s`                         Any space, tab, or newline character.  (
                           Think of this as matching white-space
                           characters.)
`\S`                         Any character that is not a space, tab,

In [55]:
s = pd.Series(['a3aa', 'b4aa', 'c5aa'])

In [56]:
s.str.extract('(\w)\d(\w\w)')

   0   1
0  a  aa
1  b  aa
2  c  aa

In [57]:
s.str.extract('(\w)\d(\w)(\w)')

   0  1  2
0  a  a  a
1  b  a  a
2  c  a  a

In [59]:
s= pd.Series(['40 l/100 km (comb)', 
        '38 l/100 km (comb)', '6.4 l/100 km (comb)',
       '8.3 kg/100 km (comb)', '5.1 kg/100 km (comb)',
       '5.4 l/100 km (comb)', '6.7 l/100 km (comb)',
       '6.2 l/100 km (comb)', '7.3 l/100 km (comb)',
       '6.3 l/100 km (comb)', '5.7 l/100 km (comb)',
       '6.1 l/100 km (comb)', '6.8 l/100 km (comb)',
       '7.5 l/100 km (comb)', '7.4 l/100 km (comb)',
       '3.6 kg/100 km (comb)', '0 l/100 km (comb)', 
       '7.8 l/100 km (comb)'])

In [63]:
result = s.str.extract('(\d\d|\d.\d|\d)')
result

      0
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8

In [64]:
result = s.str.extract('(\d\d|\d.\d|\d).+()')  # şeklinde de ikinci bir gruplama eklenebilir.
result

      0 1
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8